/* Sample PL/I program for graphify tests. */
 SAMPLEPLI: PROCEDURE OPTIONS(MAIN);
   %INCLUDE SYSLIB(CUSTREC);
   %INCLUDE SHARED;
   DECLARE I FIXED BIN(31);

   CALL INIT_DATA;
   CALL PROCESS_RECORD(I);
   CALL EXTERNAL_RTN;

 INIT_DATA: PROCEDURE;
   I = 0;
 END INIT_DATA;

 PROCESS_RECORD: PROCEDURE(N);
   DECLARE N FIXED BIN(31);
   N = N + 1;
 END PROCESS_RECORD;

 END SAMPLEPLI;
