CONFSET  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,         X
               TIOAPFX=YES
CONFMAP  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
TITLE    DFHMDF POS=(1,30),LENGTH=20,ATTRB=(PROT,BRT),INITIAL='CONFIRM'
CUSTID   DFHMDF POS=(3,1),LENGTH=8,ATTRB=(UNPROT,NUM)
ERRMAP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMSD TYPE=FINAL
         END
