* IMS PSB source
         PCB   TYPE=DB,DBDNAME=CUSTDB,PROCOPT=GO,KEYLEN=18
         SENSEG NAME=CUSTOMER,PARENT=0
         SENSEG NAME=ORDER,PARENT=CUSTOMER
         PCB   TYPE=DB,DBDNAME=ITEMDB,PROCOPT=A,KEYLEN=10
         SENSEG NAME=ITEM,PARENT=0
         PSBGEN PSBNAME=CUSTPSB,LANG=COBOL,CMPAT=YES
         END
